/** @file

Copyright (c) 2006 - 2014, Byosoft Corporation.<BR>
All rights reserved.This software and associated documentation (if any)
is furnished under a license and may only be used or copied in
accordance with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be reproduced,
stored in a retrieval system, or transmitted in any form or by any
means without the express written consent of Byosoft Corporation.

File Name:
  AtaDriverCfg.uni

Abstract:
  The definition of string used in ATA Devices setting.

Revision History:

$END--------------------------------------------------------------------

**/

/=#
#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US "English"


#string STR_MEMORY_FORM                      #language en-US "Memory Information"
                                             #language zh-Hans "\wide内存信息\narrow"
#string STR_MEMORY_FORM_HELP                 #language en-US "Select this option to see your system's memory information."
                                             #language zh-Hans "\wide选择此选项可查看系统内存信息。\narrow"

#string STR_MEMORY_SIZE_NAME                 #language en-US "Total Memory Size"
                                             #language zh-Hans "\wide内存总大小\narrow"
#string STR_MEMORY_SIZE_VALUE                #language en-US "N/A" // Dynamically updated
                                             #language zh-Hans "N/A" // Dynamically updated
#string STR_MEMORY_SIZE_HELP                 #language en-US "Total Memory in the System."
                                             #language zh-Hans "Total Memory in the System."
#string STR_MEMORY_SPEED_NAME                #language en-US "Memory Frequency"
                                             #language zh-Hans "\wide内存频率\narrow"
#string STR_MEMORY_SPEED_VALUE               #language en-US   "N/A"
                                             #language zh-Hans "N/A"


#string STR_MEM_SLOT_VALUE                      #language en-US "Manu:%a, Size:%d%a, %dRx%d, Type:%a, ECC:%a"
                                                #language zh-Hans "\wide厂商\narrow:\wide%s\narrow, \wide大小\narrow:%d%a, %dRx%d, \wide类型\narrow:%a, ECC:%a"                                       
//CPU 1     
#string STR_CPU_0_STRING                        #language en-US "CPU 0"
                                                #language zh-Hans "\wide处理器\narrow 0"
#string STR_MEM_SLOT0_STRING                    #language en-US "CPU0 DIMMA0"
                                                #language zh-Hans "\wide内存插槽\narrow A0"
#string STR_MEM_SLOT0_VALUE                     #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT1_STRING                    #language en-US "CPU0 DIMMA1"
                                                #language zh-Hans "\wide内存插槽\narrow A1"
#string STR_MEM_SLOT1_VALUE                     #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT2_STRING                    #language en-US "CPU0 DIMMB0"
                                                #language zh-Hans "\wide内存插槽\narrow B0"
#string STR_MEM_SLOT2_VALUE                     #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT3_STRING                    #language en-US "CPU0 DIMMB1"
                                                #language zh-Hans "\wide内存插槽\narrow B1"
#string STR_MEM_SLOT3_VALUE                     #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT4_STRING                    #language en-US "CPU0 DIMMC0"
                                                #language zh-Hans "\wide内存插槽\narrow C0"
#string STR_MEM_SLOT4_VALUE                     #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT5_STRING                    #language en-US "CPU0 DIMMC1"
                                                #language zh-Hans "\wide内存插槽\narrow C1"
#string STR_MEM_SLOT5_VALUE                     #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT6_STRING                    #language en-US "CPU0 DIMMD0"
                                                #language zh-Hans "\wide内存插槽\narrow D0"
#string STR_MEM_SLOT6_VALUE                     #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT7_STRING                    #language en-US "CPU0 DIMMD1"
                                                #language zh-Hans "\wide内存插槽\narrow D1"
#string STR_MEM_SLOT7_VALUE                     #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT8_STRING                    #language en-US "CPU1 DIMMA0"
                                                #language zh-Hans "\wide内存插槽\narrow A0"
#string STR_MEM_SLOT8_VALUE                     #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT9_STRING                    #language en-US "CPU1 DIMMA1"
                                                #language zh-Hans "\wide内存插槽\narrow A1"
#string STR_MEM_SLOT9_VALUE                     #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT10_STRING                   #language en-US "CPU1 DIMMB0"
                                                #language zh-Hans "\wide内存插槽\narrow B0"
#string STR_MEM_SLOT10_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT11_STRING                   #language en-US "CPU1 DIMMB1"
                                                #language zh-Hans "\wide内存插槽\narrow B1"
#string STR_MEM_SLOT11_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT12_STRING                   #language en-US "CPU1 DIMMC0"
                                                #language zh-Hans "\wide内存插槽\narrow C0"
#string STR_MEM_SLOT12_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT13_STRING                   #language en-US "CPU1 DIMMC1"
                                                #language zh-Hans "\wide内存插槽\narrow C1"
#string STR_MEM_SLOT13_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT14_STRING                   #language en-US "CPU1 DIMMD0"
                                                #language zh-Hans "\wide内存插槽\narrow D0"
#string STR_MEM_SLOT14_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT15_STRING                   #language en-US "CPU1 DIMMD1"
                                                #language zh-Hans "\wide内存插槽\narrow D1"
#string STR_MEM_SLOT15_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"  


//CPU 2                    
#string STR_CPU_1_STRING                        #language en-US "CPU 1"
                                                #language zh-Hans "\wide处理器\narrow 1"
#string STR_MEM_SLOT16_STRING                   #language en-US "DIMMA0"
                                                #language zh-Hans "\wide内存插槽\narrow A0"
#string STR_MEM_SLOT16_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT17_STRING                   #language en-US "DIMMA1"
                                                #language zh-Hans "\wide内存插槽\narrow A1"
#string STR_MEM_SLOT17_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT18_STRING                   #language en-US "DIMMB0"
                                                #language zh-Hans "\wide内存插槽\narrow B0"
#string STR_MEM_SLOT18_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT19_STRING                   #language en-US "DIMMB1"
                                                #language zh-Hans "\wide内存插槽\narrow B1"
#string STR_MEM_SLOT19_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT20_STRING                   #language en-US "DIMMC0"
                                                #language zh-Hans "\wide内存插槽\narrow C0"
#string STR_MEM_SLOT20_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT21_STRING                   #language en-US "DIMMC1"
                                                #language zh-Hans "\wide内存插槽\narrow C1"
#string STR_MEM_SLOT21_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT22_STRING                   #language en-US "DIMMD0"
                                                #language zh-Hans "\wide内存插槽\narrow D0"
#string STR_MEM_SLOT22_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT23_STRING                   #language en-US "DIMMD1"
                                                #language zh-Hans "\wide内存插槽\narrow D1"
#string STR_MEM_SLOT23_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow" 
#string STR_MEM_SLOT24_STRING                   #language en-US "DIMME0"
                                                #language zh-Hans "\wide内存插槽\narrow E0"
#string STR_MEM_SLOT24_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT25_STRING                   #language en-US "DIMME1"
                                                #language zh-Hans "\wide内存插槽\narrow E1"
#string STR_MEM_SLOT25_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT26_STRING                   #language en-US "DIMMF0"
                                                #language zh-Hans "\wide内存插槽\narrow F0"
#string STR_MEM_SLOT26_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT27_STRING                   #language en-US "DIMMF1"
                                                #language zh-Hans "\wide内存插槽\narrow F1"
#string STR_MEM_SLOT27_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT28_STRING                   #language en-US "DIMMG0"
                                                #language zh-Hans "\wide内存插槽\narrow G0"
#string STR_MEM_SLOT28_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT29_STRING                   #language en-US "DIMMG1"
                                                #language zh-Hans "\wide内存插槽\narrow G1"
#string STR_MEM_SLOT29_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT30_STRING                   #language en-US "DIMMH0"
                                                #language zh-Hans "\wide内存插槽\narrow H0"
#string STR_MEM_SLOT30_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
#string STR_MEM_SLOT31_STRING                   #language en-US "DIMMH1"
                                                #language zh-Hans "\wide内存插槽\narrow H1"
#string STR_MEM_SLOT31_VALUE                    #language en-US "Not Present"
                                                #language zh-Hans "\wide未安装\narrow"
                                                      
                                                      
                                                      
                                                      
#string STR_NOT_PASS_TRAINING                   #language en-US "Dimm Is Present But Not Pass Training"
                                                #language zh-Hans "\wide内存在位但是没有通过训练\narrow"                                                                                                                                                                                                                                                                  
                                                      
                                                      
                                                      
